public class Main {

    /*
    Создать класс грузовик Truck, содержащий общие характеристики грузовиков:
    model, manufacturer,year (год выпуска),colour,maxWeight (грузоподьемность),
    maxFuel (  обьем топливного бака), имя владельца
    и имеющий следующее поведение:
    1.должен уметь загружаться (load)  и при этом сообщать, если превышена его грузоподьемность а также сообщать
        сколько еще можно загрузить груза
    2.разгружаться и  при этом сообщать в случае если пытаются разгрузить больше чем имеющийся у него на борту груз
    или пытаются разгрузить отрицательный груз. Также должен сообщать вес остающегося на борту груза
    3. В случае отсутствия топлива или отсутствия груза на борту сообщать о невозможности ехать
    4. Должен уметь ездить и останавливаться
    4. уметь заправляться топливом
    5. уметь сообщать имя владельца

    Создать несколько грузовиков, протестировать их работу , сложить в массив и вывести на экран


     */
    public static void main(String[] args) {
       // Truck truck = new Truck();
       // System.out.println(truck.i);
       // System.out.println(truck.b);
       // System.out.println(truck.s);
    }
}
