public class Homework {

    public static void main(String[] args) {
        /*
        Написать программу, выводящую на экран значение переменной типа инт в квадрате.
        Предварительно обьявите эту переменную и задайте ее значение
         */

        int x = 2;
        System.out.println(x * x * x);
    }
}
