public class Main {
    /*
    Object -        некая сущность (entity), имеющая состояние и поведение ( state and behaviour)
    Class -         шаблон для создания обьектов
    Encapsulation - обьединение в одном классе переменных и методов. Переменные должны быть приватными , а доступ к ним
                    осуществляться через соответствующие геттеры и сеттеры
    Inheritance  -  процесс, посредством которого один класс приобретает свойства и поведение другого класса
    Polymorphism -  свойство ООП, позволяющее выполнять одно и тоже действие разными способами
    Abstraction
     */
}
